UdaySinghG70/MCXA156/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void)
{
    /* GPIO2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO2);
    /* GPIO3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO3);
    /* GPIO4: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO4);
    /* PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* PORT3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    /* PORT4: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT4);
    /* GPIO2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO2_RST_SHIFT_RSTn);
    /* GPIO3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO3_RST_SHIFT_RSTn);
    /* GPIO4 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO4_RST_SHIFT_RSTn);
    /* ADC1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kADC1_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);
    /* LPUART2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kLPUART2_RST_SHIFT_RSTn);
    /* PORT3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);
    /* PORT4 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT4_RST_SHIFT_RSTn);

    gpio_pin_config_t D0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_1 (pin 34)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_D0_GPIO, BOARD_INITDEBUG_UARTPINS_D0_PIN, &D0_config);

    gpio_pin_config_t D1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_20 (pin 55)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_D1_GPIO, BOARD_INITDEBUG_UARTPINS_D1_PIN, &D1_config);

    gpio_pin_config_t D2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_21 (pin 56)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_D2_GPIO, BOARD_INITDEBUG_UARTPINS_D2_PIN, &D2_config);

    gpio_pin_config_t KEY4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_22 (pin 57)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_KEY4_GPIO, BOARD_INITDEBUG_UARTPINS_KEY4_PIN, &KEY4_config);

    gpio_pin_config_t KEY3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_1 (pin 105)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_KEY3_GPIO, BOARD_INITDEBUG_UARTPINS_KEY3_PIN, &KEY3_config);

    gpio_pin_config_t D4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_12 (pin 92)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_D4_GPIO, BOARD_INITDEBUG_UARTPINS_D4_PIN, &D4_config);

    gpio_pin_config_t D5_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_13 (pin 91)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_D5_GPIO, BOARD_INITDEBUG_UARTPINS_D5_PIN, &D5_config);

    gpio_pin_config_t D6_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_15 (pin 89)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_D6_GPIO, BOARD_INITDEBUG_UARTPINS_D6_PIN, &D6_config);

    gpio_pin_config_t D7_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_16 (pin 88)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_D7_GPIO, BOARD_INITDEBUG_UARTPINS_D7_PIN, &D7_config);

    gpio_pin_config_t KEY2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_17 (pin 87)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_KEY2_GPIO, BOARD_INITDEBUG_UARTPINS_KEY2_PIN, &KEY2_config);

    gpio_pin_config_t KEY1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_22 (pin 81)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_KEY1_GPIO, BOARD_INITDEBUG_UARTPINS_KEY1_PIN, &KEY1_config);

    gpio_pin_config_t D3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_3 (pin 24)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_D3_GPIO, BOARD_INITDEBUG_UARTPINS_D3_PIN, &D3_config);

    gpio_pin_config_t E_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_6 (pin 27)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_E_GPIO, BOARD_INITDEBUG_UARTPINS_E_PIN, &E_config);

    gpio_pin_config_t RS_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_7 (pin 28)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_RS_GPIO, BOARD_INITDEBUG_UARTPINS_RS_PIN, &RS_config);

    /* PORT1_14 (pin 7) is configured as ADC1_A12 */
    PORT_SetPinMux(PORT1, 14U, kPORT_MuxAlt0);

    PORT1->PCR[14] = ((PORT1->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT2_1 (pin 34) is configured as P2_1 */
    PORT_SetPinMux(BOARD_INITDEBUG_UARTPINS_D0_PORT, BOARD_INITDEBUG_UARTPINS_D0_PIN, kPORT_MuxAlt0);

    PORT2->PCR[1] = ((PORT2->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    const port_pin_config_t port2_2_pin35_config = {/* Internal pull-up resistor is enabled */
                                                    .pullSelect = kPORT_PullUp,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = kPORT_LowDriveStrength,
                                                    /* Normal drive strength is configured */
                                                    .driveStrength1 = kPORT_NormalDriveStrength,
                                                    /* Pin is configured as LPUART2_TXD */
                                                    .mux = kPORT_MuxAlt3,
                                                    /* Digital input enabled */
                                                    .inputBuffer = kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                    .invertInput = kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = kPORT_UnlockRegister};
    /* PORT2_2 (pin 35) is configured as LPUART2_TXD */
    PORT_SetPinConfig(PORT2, 2U, &port2_2_pin35_config);

    PORT2->PCR[20] = ((PORT2->PCR[20] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                      /* Pin Multiplex Control: PORT2_20 (pin 55) is configured as P2_20. */
                      | PORT_PCR_MUX(PORT2_PCR20_MUX_mux00)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[21] = ((PORT2->PCR[21] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

